menu = [{innerText: "Английский язык", href: "./Английский язык/index.html"},
{ innerText: "Дифференциальные уравнения", href: "./Курс 2/Дифференциальные уравнения/index.html" },
{ innerText: "Общий физический практикум", href: "./Общий физический практикум/index.html" },
{ innerText: "Теоретическая механика", href: "./Курс 2/Теоретическая механика/index.html" },
{ innerText: "Теория функций комплексного переменного", href: "./Курс 2/Теория функций комплексного переменного/index.html" },
{ innerText: "Учебная практика", href: "./Учебная практика/index.html"},
{ innerText: "Электричество и магнетизм", href: "./Курс 2/Электричество и магнетизм/index.html" }]
site.add_navigation("Семестр 1", menu);
menu = [{innerText: "Английский язык", href: "./Английский язык/index.html"},
{ innerText: "Векторно тензорный анализ", href: "./Курс 2/Векторный и тензорный анализ/index.html" },
{ innerText: "Колебания и волны, оптика", href: "./Курс 2/Колебания и волны Оптика/index.html" },
{ innerText: "Общий физический практикум", href: "./Общий физический практикум/index.html" },
{ innerText: "Теоретическая механика", href: "./Курс 2/Теоретическая механика/index.html" },
{ innerText: "Методы математической физики", href: "./Методы математической физики/index.html" }]
site.add_navigation("Семестр 2", menu);