menu = [{innerText: "Описание предмета", href: "./Общий физический практикум/Описание предмета.html"}]
site.add_navigation("Полезные статьи", menu);
menu = [{innerText: "(112) Определение ускорения свободного падения", href: "./Общий физический практикум/Определение ускорения свободного падения/index.html"},
{ innerText: "(117) Осциллограф", href: "./Общий физический практикум/Осциллограф/index.html" },
{ innerText: "(122) Определение коэффициента вязкого трения", href: "./Общий физический практикум/Определение коэффициента вязкого трения/index.html" },
{ innerText: "(125) Изучение колебательного движения", href: "./Общий физический практикум/Изучение колебательного движения/index.html" },
{ innerText: "(126) Определение удельного заряда электрона методом магнитного запирания катода",
href: "./Общий физический практикум/Определение удельного заряда электрона методом магнитного запирания катода/index.html" },
{ innerText: "(127) Машина Атвуда", href: "./Общий физический практикум/Машина Атвуда/index.html" },
{ innerText: "(131) Некоторые законы случайных событий", href: "./Общий физический практикум/Некоторые законы случайных событий/index.html" }]
site.add_navigation("Семестр 1", menu);
menu = [{innerText: "(110) Гироскоп", href: "./Общий физический практикум/Гироскоп/index.html"}]
site.add_navigation("Семестр 2", menu);
menu = [{innerText: "(204) Эффект Холла", href: "./Общий физический практикум/Эффект Холла/index.html"},
{ innerText: "(205) Измерение ЭДС методом компенсации", href: "./Общий физический практикум/Измерение ЭДС методом компенсации/index.html" },
{ innerText: "(210) Исследование линейных двухполюсников и четырёхполюсников", href: "./Общий физический практикум/Исследование линейных двухполюсников и четырёхполюсников/index.html" },
{ innerText: "(212) Дифференцирование и интегрирование сигналов", href: "./Общий физический практикум/Дифференцирование и интегрирование сигналов/index.html" },
{ innerText: "(218) Измерение ёмкости конденсатора", href: "./Общий физический практикум/Измерение ёмкости конденсатора/index.html" },
{ innerText: "(219) Исследование электронных ламп диода и триода", href: "./Общий физический практикум/Исследование электронных ламп диода и триода/index.html" },
{ innerText: "(222) Изучение электрического разряда в неоновой лампе", href: "./Общий физический практикум/Излучение электрического разряда в неоновой лампе/index.html" }]
site.add_navigation("Семестр 3", menu);
menu = [{innerText: "(206) Гармонический анализ и синтез периодических сигналов", href: "./Общий физический практикум/Гармонический анализ и синтез периодических сигналов/index.html"},
{ innerText: "(208) Параметрический резонанс", href: "./Общий физический практикум/Параметрический резонанс/index.html" },
{ innerText: "(211) Продольные ультразвуковые волны в проволоке", href: "./Общий физический практикум/Продольные ультразвуковые волны в проволоке/index.html" },
{ innerText: "(217) Исследование колебательных процессов в электрическом контуре", href: "./Общий физический практикум/Исследование колебательных процессов в электрическом контуре/index.html" },
{ innerText: "(301) Дифракция света на ультразвуке", href: "./Общий физический практикум/Дифракция света на ультразвуке/index.html" },
{ innerText: "(312) Прибор Норренберга", href: "./Общий физический практикум/Прибор Норренберга/index.html" },
{ innerText: "(320) Дифракция Фраунгофера", href: "./Общий физический практикум/Дифракция Фраунгофера/index.html" }]
site.add_navigation("Семестр 4", menu);