menu = [{innerText: "Описание предмета", href: "./Общий физический практикум/Описание предмета.html"}]
site.add_navigation("Полезные статьи", menu);
menu = [{innerText: "(112) Определение ускорения свободного падения", href: "./Общий физический практикум/"},
{ innerText: "(117) Осциллограф", href: "./Общий физический практикум/" },
{ innerText: "(122) Определение коэффициента вязкого трения", href: "./Общий физический практикум/" },
{ innerText: "(125) Изучение колебательного движения", href: "./Общий физический практикум/" },
{ innerText: "(126) Определение удельного заряда электрона методом магнитного запирания катода", href: "./Общий физический практикум/" },
{ innerText: "(127) Машина Атвуда", href: "./Общий физический практикум/" },
{ innerText: "(131) Некоторые законы случайных величин", href: "./Общий физический практикум/" }]
site.add_navigation("Семестр 1", menu);
menu = [{innerText: "(110) Гироскоп", href: "./Общий физический практикум/"}]
site.add_navigation("Семестр 2", menu);
menu = [{innerText: "(204) Эффект Холла", href: "./Общий физический практикум/"},
{ innerText: "(205) Измерение ЭДС методом компенсации", href: "./Общий физический практикум/" },
{ innerText: "(210) Исследование линейных двухполюсников и четырёхполюсников", href: "./Общий физический практикум/" },
{ innerText: "(212) Дифференцирование и интегрирование сигналов", href: "./Общий физический практикум/" },
{ innerText: "(218) Измерение ёмкости конденсатора", href: "./Общий физический практикум/" },
{ innerText: "(219) Исследование электронных ламп диода и триода", href: "./Общий физический практикум/" },
{ innerText: "(222) Изучение электрического разряда в неоновой лампе", href: "./Общий физический практикум/" }]
site.add_navigation("Семестр 3", menu);
menu = [{innerText: "(206) Гармонический анализ и синтез периодических сигналов", href: "./Общий физический практикум/"},
{ innerText: "(208) Параметрический резонанс", href: "./Общий физический практикум/" },
{ innerText: "(211) Продольные ультразвуковые волны в проволоке", href: "./Общий физический практикум/" },
{ innerText: "(217) Исследование колебательных процессов в электрическом контуре", href: "./Общий физический практикум/" },
{ innerText: "(301) Дифракция света на ультразвуке", href: "./Общий физический практикум/" },
{ innerText: "(312) Прибор Норренберга", href: "./Общий физический практикум/" },
{ innerText: "(320) Дифракция Фраунгофера", href: "./Общий физический практикум/" }]
site.add_navigation("Семестр 4", menu);